In [28]:
import pandas as pd

In [29]:
import json

data = "{'contact_id': 4661, 'name': 'Cecilia Velasco', 'email': 'cecilia.velasco@rodrigues.fr'}"

data = data.replace("'", '"')
print(data)

{"contact_id": 4661, "name": "Cecilia Velasco", "email": "cecilia.velasco@rodrigues.fr"}

In [30]:
data



# Convert the string data to a dictionary.
converted_data = json.loads(data)
# Iterate through the dictionary (row) and get the values.
row_values = [v for k, v in converted_data.items()]
print(row_values)

[4661, 'Cecilia Velasco', 'cecilia.velasco@rodrigues.fr']

In [31]:
row_values

[4661, 'Cecilia Velasco', 'cecilia.velasco@rodrigues.fr']

In [32]:
# findall formula

#   re.findall(pattern, string)

In [33]:
# finding substrings without punctuation as a guide

string_data = "contact_id 4661 name Cecilia Velasco email cecilia.velasco@rodrigues.fr"

# Import the regular expression module.
import re
# Assign the string data to a variable. 
string_data = "contact_id 4661 name Cecilia Velasco email cecilia.velasco@rodrigues.fr"
# Extract the four digit number.
contact_id = re.findall(r'(\d{4})', string_data)
print(contact_id)

['4661']

In [34]:
# the regular expression above is 

# \d{4}


# \d    matches a numerical digit

# {4}   says to match a numerical digit 4 times

# we put the r letter (without quotation marks) before the regex to tell python to treat our regex as raw strings

#regular expression within parentheses is called the capture group

In [35]:
# Import the Pandas dependency.
import pandas as pd


# Read the contacts string data into a Pandas DataFrame
contacts_string_df = pd.read_csv("Resources/contacts_string_data.csv")
contacts_string_df.head()

                                        contact_info
0  contact_id 4661 name Cecilia Velasco email cec...
1  contact_id 3765 name Mariana Ellis email maria...
2  contact_id 4187 name Sofie Woods email sofie.w...
3  contact_id 4941 name Jeanette Iannotti email j...
4  contact_id 2199 name Samuel Sorgatz email samu...

In [13]:
#in this cell, we are going to extract all of the contact ids from the dataframe (one column dataframe), using a regular expression
# we will store the extracted contact_id's in a new column called "contact_id"

contacts_string_df['contact_id'] = contacts_string_df['contact_info'].str.extract(r'(\d{4})')


contacts_string_df

                                          contact_info contact_id
0    contact_id 4661 name Cecilia Velasco email cec...       4661
1    contact_id 3765 name Mariana Ellis email maria...       3765
2    contact_id 4187 name Sofie Woods email sofie.w...       4187
3    contact_id 4941 name Jeanette Iannotti email j...       4941
4    contact_id 2199 name Samuel Sorgatz email samu...       2199
..                                                 ...        ...
995  contact_id 3684 name Whitney Noack email whitn...       3684
996  contact_id 5784 name Gelsomina Migliaccio emai...       5784
997  contact_id 1498 name Evangelista Pereira email...       1498
998  contact_id 6073 name Gareth Comolli email gare...       6073
999  contact_id 4939 name Michelangelo Hess email m...       4939

[1000 rows x 2 columns]

In [21]:
string_data

'contact_id 4661 name Cecilia Velasco email cecilia.velasco@rodrigues.fr'

In [22]:
#Section 8.4.3 Begins

# Extract the first and last name after the word "name". 
name = re.findall(r'([^name\s+][A-Za-z]+\s+[A-Za-z]+)', string_data)
name

['Cecilia Velasco', 'il cecilia']

In [24]:
# since the 'il' form email is matched, we need to modify the regex to not include il

# to do this, we added 'il' after name, and before the first \s 'include whitespace' character.

name = re.findall(r'([^nameil\s+][A-Za-z]+\s+[A-Za-z]+)', string_data)

name

['Cecilia Velasco']

In [38]:
# practice extracting the name from the contact_info column of the contacts_string_df DataFrame yourself in the following skill drill

contacts_string_df

                                          contact_info
0    contact_id 4661 name Cecilia Velasco email cec...
1    contact_id 3765 name Mariana Ellis email maria...
2    contact_id 4187 name Sofie Woods email sofie.w...
3    contact_id 4941 name Jeanette Iannotti email j...
4    contact_id 2199 name Samuel Sorgatz email samu...
..                                                 ...
995  contact_id 3684 name Whitney Noack email whitn...
996  contact_id 5784 name Gelsomina Migliaccio emai...
997  contact_id 1498 name Evangelista Pereira email...
998  contact_id 6073 name Gareth Comolli email gare...
999  contact_id 4939 name Michelangelo Hess email m...

[1000 rows x 1 columns]

In [43]:
contacts_string_df["name"] = contacts_string_df["contact_info"].str.extract(r'([^nameil\s+][A-Za-z]+\s+[A-Za-z]+)')

In [44]:
contacts_string_df

                                          contact_info                  name
0    contact_id 4661 name Cecilia Velasco email cec...       Cecilia Velasco
1    contact_id 3765 name Mariana Ellis email maria...         Mariana Ellis
2    contact_id 4187 name Sofie Woods email sofie.w...           Sofie Woods
3    contact_id 4941 name Jeanette Iannotti email j...     Jeanette Iannotti
4    contact_id 2199 name Samuel Sorgatz email samu...        Samuel Sorgatz
..                                                 ...                   ...
995  contact_id 3684 name Whitney Noack email whitn...         Whitney Noack
996  contact_id 5784 name Gelsomina Migliaccio emai...  Gelsomina Migliaccio
997  contact_id 1498 name Evangelista Pereira email...   Evangelista Pereira
998  contact_id 6073 name Gareth Comolli email gare...        Gareth Comolli
999  contact_id 4939 name Michelangelo Hess email m...     Michelangelo Hess

[1000 rows x 2 columns]

In [53]:
contacts_string_df = contacts_string_df[["contact_info", "name"]]

In [54]:
contacts_string_df

,contact_info,name
0,contact_id 4661 name Cecilia Velasco email cec...,contact_id 4661 name Cecilia Velasco email cec...
1,contact_id 3765 name Mariana Ellis email maria...,contact_id 3765 name Mariana Ellis email maria...
2,contact_id 4187 name Sofie Woods email sofie.w...,contact_id 4187 name Sofie Woods email sofie.w...
3,contact_id 4941 name Jeanette Iannotti email j...,contact_id 4941 name Jeanette Iannotti email j...
4,contact_id 2199 name Samuel Sorgatz email samu...,contact_id 2199 name Samuel Sorgatz email samu...
...,...,...
995,contact_id 3684 name Whitney Noack email whitn...,contact_id 3684 name Whitney Noack email whitn...
996,contact_id 5784 name Gelsomina Migliaccio emai...,contact_id 5784 name Gelsomina Migliaccio emai...
997,contact_id 1498 name Evangelista Pereira email...,contact_id 1498 name Evangelista Pereira email...
998,contact_id 6073 name Gareth Comolli email gare...,contact_id 6073 name Gareth Comolli email gare...
999,contact_id 4939 name Michelangelo Hess email m...,contact_id 4939 name Michelangelo Hess email m...